import type { Coach } from '../types';

export const coaches: Coach[] = [
  {
    name: 'Νίκος Σαμαράς',
    role: 'Επικεφαλής Αγωνιστικού Τμήματος',
    bio: 'Ο Νίκος με περισσότερα απο 30 χρόνια προπονητικής εμπειρίας είναι ο team leader και προπονητής του αγωνιστικού τμήματος',
    specialties: ['Αλπικό Σκι', 'Αγωνιστικό Σκι']
  },
  {
    name: 'Παναγιώτης',
    role: 'Προπονητής snowboard',
    bio: 'Σουηδός αλπινιστής με αναβάσεις σε έξι ηπείρους που αγαπά να μοιράζεται συστήματα σχοινιών και τεχνικές διάσωσης.',
    specialties: ['Snowboard', 'Αγωνιστική χιονοσανίδα']
  },
  {
    name: 'Θωμάς Πατσάνης',
    role: 'Προπονητής Ski',
    certifications: ['EOXA Certified'],
    bio: 'Παλιός αθλητής χιονοδρομίας. Πιστοποιημένος προπονητής χιονοδρομίας τα τελευταία 10 χρόνια, σε παιδιά απο 5 έως 12 ετών',
    specialties: ['Αλπικό Ski', 'Μαθήματα σε παιδιά']
  },
  {
    name: 'Θεοδώρα Σαμαρά',
    role: 'Προπονήτρια Ski',
    bio: 'Αθλήτρια με πανελλαδικές διακρίσεις. Αψογη παιδαγωγός και προπονήτρια των μικρών μας φίλων',
    specialties: ['Αλπικό Ski', 'Μαθήματα απο 4 χρονών']
  },
  {
    name: 'Αντώνης Σαμαράς',
    role: 'Προπονητής Ski',
    bio: 'Αθλητής του σκι με πανελλαδικές διακρίσεις. Προπονητής προεφηβικού τμήματος',
    specialties: ['Αλπικό Ski', 'Freestyle Ski', 'Αγωνιστικό Ski']
  },
  {
    name: 'Δημήτρης Καπουσούζης',
    role: 'Προπονητής Ski',
    bio: 'Ο Δημήτρης είναι ο νεότερος προπονητής μας. Αθλητής σκι και κωπηλασίας με πανελλαδικές διακρίσεις. Προπονεί το τμήμα ενηλίκων',
    specialties: ['Αλπικό Ski', 'Νεανικά προγράμματα']
  }
];
